CSI API ETABS v1

# cAreaObjSetLoadWindPressure Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetLoadWindPressure(
    	string Name,
    	string LoadPat,
    	int MyType,
    	double Cp,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetLoadWindPressure (
    	Name As String,
    	LoadPat As String,
    	MyType As Integer,
    	Cp As Double,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim LoadPat As String
    Dim MyType As Integer
    Dim Cp As Double
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetLoadWindPressure(Name,
    	LoadPat, MyType, Cp, ItemType)

    int SetLoadWindPressure(
    	String^ Name,
    	String^ LoadPat,
    	int MyType,
    	double Cp,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetLoadWindPressure :
            Name : string *
            LoadPat : string *
            MyType : int *
            Cp : float *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

LoadPat

    Type: SystemString

MyType

    Type: SystemInt32

Cp

    Type: SystemDouble

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com